# System messages
start_bot_message = "☄️ ValeraSeriesBot started"
stop_bot_message = "🙊 ValeraSeriesBot stopped"

# Info messages variables
available_commands = "<b>/start</b> - Как работает бот.\n"\
                     "<b>/help</b> - Список доступных комманд.\n" \
                     "<b>/search</b> - Поиск аниме.\n" \
                     "<b>/support</b> - Узнай, как можно улучшить проект.\n"\
                     "<b>/vlc</b> - Узнать больше про VLC-плеер."

# Info messages
help_message = "🤖 Бот поддерживает следующие комманды:\n" + available_commands

get_start_message = "<b>🫡 Привет!</b>\n" \
                    "🐶 Здесь ты можешь смотреть аниме бесплатно и без рекламы.\n" \
                    "💡 Для просмотра аниме потребуется установить <b>VLC-плеер.</b>\n" \
                    "📚 <i>Узнать подробнее про VLC-плеер можно тут</i> <b>/vlc</b>\n\n" \
                    "Список доступных комманд находится в меню.\n" \
                    "А также тут <b>/help</b>" \

vlc_message = "💡 Бот использует ту же технологию, что и онлайн-кинотеатры.\n" \
              "✂️ Каждое видео разбивается на маленькие кусочки, " \
              "и за счет этого не нужно загружать видео целиком - " \
              "каждый кусочек загружается отдельно и не занимает много места.\n" \
              "💾 На каждое видео приходит маленький файл в формате .m3u8.\n" \
              "📂 Это файл-папочка для этих кусочков, " \
              "и чтобы все заработало нам потребуется VLC-плеер," \
              "вы можете попробовать и другой, но может не заработать.\n" \
              "⚙️ Чтобы открыть .m3u8 файл, его нужно импортировать в самом VLC-плеере, " \
              "или открыть этот файл с помощью VLC.\n\n" \
              "🔗 Скачать VLC-плеер можно в магазине приложений или " \
              "на официальном сайте https://www.videolan.org/vlc/"

support_message = "Тут пока что пусто"

# Handlers messages
search_message = "Поиск аниме"
